app/controllers/home_controller.rb

INSERT INTO "posts" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 08 Jan 2013 22:52:30 UTC +00:00], ["title", "Hello world"], ["updated_at", Tue, 08 Jan 2013 22:52:30 UTC +00:00]]
---
  def index
    if request.post?
      Post.create(params[:post])